{
  "book_id": 56597885,
  "name": "Beautiful World, Where Are You",
  "cover": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1618329605i/56597885.jpg",
  "url": "https://www.goodreads.com/book/show/56597885",
  "authors": [
    "Sally Rooney"
  ],
  "rating": 3.54,
  "pages": 356,
  "published_date": "September 7, 2021",
  "synopsis": "Alice, a novelist, meets Felix, who works in a warehouse, and asks him if he’d like to travel to Rome with her. In Dublin, her best friend, Eileen, is getting over a break-up and slips back into flirting with Simon, a man she has known since childhood. Alice, Felix, Eileen, and Simon are still young—but life is catching up with them. They desire each other, they delude each other, they get together, they break apart. They have sex, they worry about sex, they worry about their friendships and the world they live in. Are they standing in the last lighted room before the darkness, bearing witness to something? Will they find a way to believe in a beautiful world?Sally Rooney was born in 1991 and lives in Dublin, where she graduated from Trinity College. Her work has appeared in Granta, The Dublin Review, The White Review, The Stinging Fly, and the Winter Pages anthology.“Purposeful awkwardness” is how I can describe this book in just two words. I don’t know whether that goes along with supposedly being a voice of an entire generation to which I belong — but awkwardness permeates everything, and my reactions fluctuated between boredom, periodic cringing and occasional spark of recognition and relatability — which unfortunately ended up buried under the awkward bits much too often.Oh, and before I forget in the rants to come — dear writers, please oh please do not skip dialogue tags in your writing. Why??? It’s not fresh or daring but just irritating, and I know you know how to use them.It’s a story about nothing much, really. It follows four people who make up two eventual couples - Alice and Felix and on the other side of the country Eileen and Simon. There are multitudes of details of their daily routines, either pointlessly awkward or perhaps profound (depending on the point of view, I suppose) conversations - verbal and text messages - and quite a few pages of detailed, mechanistic and honestly quite boring and exceedingly awkward almost-voyeristic sex. And every other chapter there is a complete tone shift from that to the flourishing long emails between Eileen and Alice about more profound things in life, at times sophisticated and at times naive and yet painfully earnest and quite a bit reminiscent of those wine-fueled intellectual conversations in college in which truthseeking was stubbornly pursued. \nI can read stories about nothing much. But what made me cringe and shrug in frustrated boredom was the language of the bulk of the book, clearly done intentionally as those interlude emails show a completely different and much more engaging style. But the majority of the book is written basically like a screenplay, with step-by-step instructions. What’s with all these details? Is it an attempt at distancing the reader and have them figure things out on their own? Is it a gimmick that for some reason sounded interesting at one point? Is it compassion for the person eventually adapting this to the big or small screen? I suspect the latter, given that this will probably join the queue of Rooney adaptations. Seriously, check this out:\n  “He asked her what she wanted to drink and then went to the bar to order. The waitress asked how he was getting on, and he answered: Good yeah, yourself? He ordered a vodka tonic and a pint of lager. Rather than carrying the bottle of tonic back to the table, he emptied it into the glass with a quick and practised movement of his wrist. The woman at the table tapped her fingers on a beermat, waiting. Her outward attitude had become more alert and lively since the man had entered the room. She looked outside now at the sunset as if it were of interest to her, though she hadn’t paid any attention to it before. When the man returned and put the drinks down, a drop of lager spilled over and she watched its rapid progress down the side of his glass.”\nImagination rests here as it has nothing to do. Everything is spelled out. Everything. I mean, here’s the passage that should have been “she found her keys and opened the door”:\n  “She walked lightly up the path and searched in her handbag for the house keys. The noise of the keys was audible somewhere inside the bag but she didn’t seem to be able to find them. He stood there not saying anything. She apologised for the delay and switched on the torch function on her phone, lighting the interior of her bag and casting a cold grey light on the front steps of the house also. He had his hands in his pockets. Got them, she said. Then she unlocked the door.”\nTired reading the details yet? Oh dear, now imagine the entire book like this:\n  “At twenty past twelve on a Wednesday afternoon, a woman sat behind a desk in a shared office in Dublin city centre, scrolling through a text document. She had very dark hair, swept back loosely into a tortoiseshell clasp, and she was wearing a grey sweater tucked into black cigarette trousers. Using the soft greasy roller on her computer mouse she skimmed over the document, eyes flicking back and forth across narrow columns of text, and occasionally she stopped, clicked, and inserted or deleted characters. Most frequently she was inserting two full stops into the name ‘WH Auden’, in order to standardise its appearance as ‘W.H. Auden’. When she reached the end of the document, she opened a search command, selected the Match Case option and searched: ‘WH’. No matches appeared.”\nAnd here is Sally Rooney for some reason explaining to Millenials how to use Google Maps:\n  “He typed his address into the search bar without looking up. Yeah, he said. They have me on really random shifts this week. He handed her back the phone to show her the address: 16 Ocean Rise. The screen displayed a network of white streets on a background of grey, beside a blue area representing the sea.”\nAnd that is just the beginning of the book. This goes on for hundreds of pages until by the end you feel mostly desensitized — but for me that did not happen soon enough to translate into enjoyment. Why oh why would you purposefully subject your readers to pointless description and monotonous step-by-step detailing of everything? More under spoiler tag:\n  “Squinting at the screen of her phone, she tapped the icon of a social media app. The interface opened and displayed a loading symbol.”And that loading symbol is clearly very important for this story. Of course it needs page space.“After they hung up, she plugged a charging cable into her phone and switched off the bedside light. The artificial orange glow of urban light pollution permeated the thin curtains of her bedroom window. With her eyes still open, she touched herself for a minute and a half* , came noiselessly, and then turned over on her side to go to sleep.”*I’m glad it was *exactly* a minute and a half of masturbation, not a minute or two or three.“Did Felix find her answers interesting, or was he bored? Was he thinking about her, or about something else, someone else? And onstage, speaking about her books, was Alice thinking about him? Did he exist for her in that moment, and if so, in what way?”I don’t know, you tell me or at least show me — or I guess you can pose the questions to make the jobs of all the book clubs eventually discussing this story easier.\n  \nAnd then we have those email interludes between Alice and Eileen where we get a smattering on opinions and musings on consumerism, politics, sexuality, identity, capitalism, religion, beauty and meaning of life. They seem to be chapters in a longer essay interspersed among the banal scenes in the novel, contrasting with the surrounding chapters in a way that was becoming grating of distracting.\n  “At times I think of human relationships as something soft like sand or water, and by pouring them into particular vessels we give them shape. So a mother’s relationship with her daughter is poured into a vessel marked ‘mother and child’, and the relationship takes the contours of its container and is held inside there, for better or worse. Maybe some unhappy friends would have been perfectly contented as sisters, or married couples as parents and children, who knows. But what would it be like to form a relationship with no preordained shape of any kind? Just to pour the water out and let it fall. I suppose it would take no shape, and run off in all directions.”\n————And then I came across this passage that made me think that Rooney is just deliberately f*cking with the readers:\n  \n    “Who can care, in short, what happens to the novel’s protagonists, when it’s happening in the context of the increasingly fast, increasingly brutal exploitation of a majority of the human species?”\n  \nUmmm, Ms. Rooney? I do. I care. The world sucks and we are dooming the planet, but you put protagonists in a book and I care about their fictional lives. That’s my problem as a reader. I care despite the world we live in. \n————I don’t have much to say about the characters, even after pages and pages and pages. Alice and Felix perplexed and bored me since I have no idea what in him would be attractive to her, no why she would be content of engaging in humiliation that he seems to frustratingly dump all over her. I don’t get the overly monotonous and detailed sex scenes that were nothing but awkward — seriously, fade to black once to spare me the eye rolling! Awkward! Eileen and Simon were marginally less cringe-inducing (minus all those awkward detailed sex scenes, of course — because god forbid Rooney skips a detail anywhere!). But at least those two did not make me want to gauge my eyes out with a spoon. Except for this — “Can we? she asked. He said yes. They took their underwear off. I’ll get a condom, he said. She told him she was on the pill, and he seemed to hesitate” — because you know the guy is sleeping with another woman who’s sleeping with other people and chlamydia is not stopped by birth control pills. And in the end we get more of the same - “I don’t have a condom, he said. She told him it was okay. Then she added: As long as you’re not having unprotected sex with anyone else.” — but how about all that unprotected sex he’s already had??? But their romantic struggles were hard to buy — Eileen and Simon clearly needed to be together after the first few pages, while Alice and Felix really had nothing keeping them together. They should not have had similar trajectories of push and pull and eventual happy ending — the symmetry of their love stories is unearned.\n   “Maybe we’re just born to love and worry about the people we know, and to go on loving and worrying even when there are more important things we should be doing. And if that means the human species is going to die out, isn’t it in a way a nice reason to die out, the nicest reason you can imagine? Because when we should have been reorganising the distribution of the world’s resources and transitioning collectively to a sustainable economic model, we were worrying about sex and friendship instead. Because we loved each other too much and found each other too interesting. And I love that about humanity, and in fact it’s the very reason I root for us to survive—because we are so stupid about each other.”\nEventually somewhere at the 2/3rds mark (the wedding scene) the writing style improves a bit, with detail overload lessening and some life breathed into the deadpan list-filled prose by finally allowing us into the characters heads instead of just observing their actions in minute details (or maybe it stayed the same but book Stockholm Syndrome had kicked in) — but although less cringeworthy, it did not leave me much time to forge any connections to anyone or anything in the book. Yes, there were moments where I felt that “aha!” connection, but only briefly and far too rarely. And even the sweet ending still felt banal and unmoving to me. And I was left with that vaguely dissatisfied feeling at the end. The feeling that I read something that did not strike a chord with me although it should have had. The irritation at the needless lack of dialogue tags. The weird pompousness of the emails sections starting with the banality of mundane details. The lingering cringeness of voyeristically awkward sex scenes. The mostly uninteresting characters. The overload of philosophy that calls for alcohol-fueled student gathering. Meh. Left me mostly cold.2 stars. Let me start this review by saying that I think Sally Rooney is an excellent writer on the sentence level. Every word moves the plot forward or illustrates a meaningful detail about her characters. Her dialogue in particular is extraordinary. Even though I had mixed feelings about \n  Conversations with Friends\n and kinda detested \n  Normal People\n, I still read this novel because I remembered how immersed I felt in her past characters’ conversations with one another. For example, in Beautiful World, Where Are You there’s one scene in which Eileen sees Simon at a wedding and the narrative does this montage-esque time lapse thing where it recounts a significant portion of Eileen and Simon’s coming-of-age with one another within the span of half a chapter or so. This section of the novel literally took my breath away, like I literally paused at the end of the chapter and thought to myself “wow, she did that.” That being said, I still significantly disliked this novel, especially its latter half. For the first 50% I thought Beautiful World, Where Are You might serve as my first higher-than-three-star Sally Rooney novel, then many elements of the book took a nosedive. Here are the top three features of this book that soured it for me.1. A lack of depth in the characters’ motivations and desires. For example, at one point Eileen writes to Alice that she feels that her life would have been significantly better if she had married Simon earlier on. Eileen also pushes and pulls Simon away from her throughout the novel. However, there’s no deeper exploration of why Eileen feels so incomplete and wretched without Simon nor is there any sincere introspection about why she treats him the way she does. I feel like because Rooney is such a talented writer, she makes Eileen and the other characters’ angst about their situations so interesting and dynamic. However, interesting and dynamic angst is not the same thing as angst that is actually processed or learned from. There’s a big moment at the end of the novel with all four characters that kinda functions as this major catharsis followed by a denouement, though I didn’t observe any increased self-awareness there either.2. Rooney focuses on the romantic dynamics between Eileen and Simon and Alice and Felix at the expense of more robust character development. While Rooney, again, writes immersive conversations and scenes between these characters and their love interests, the focus on the romantic elements detracted from more nuanced growth. Eileen faces a complicated dynamic with her sister and their parents, while Alice experienced psychiatric hospitalization and continues to face mental health issues. Instead of developing these aspects of Eileen and Alice, Rooney throws them into situations with Simon and Felix over and over with no reprieve. Even when Eileen and Alice finally reunite in person, Simon and Felix are present and take up space that could have been spent fleshing out the women’s friendship. The ending of the novel thus felt cheapened given the lack of actual growth on any of the characters’ behalf.3. Okay, what the heck purpose did Felix serve in this novel? Felix is literally an awful, emotionally volatile man and there’s no accountability for his actions nor a basic recognition of his garbage behaviors? He watches pornography that’s degrading to women, is outright mean to Alice on multiple occasions, is cruel to Eileen about her friendship with Alice, tries to take advantage of Simon when Simon experiences a moment of emotional fragility, and avoids communicating with his brother like any basic human decent being would after their mom dies. The worst part about all of this is that the novel doesn’t even reprimand Felix for these behaviors nor does it explore the root of his actions in an even halfhearted-way, it just lets Felix act horrible and end up relatively unscathed. If you read this book and think that the way Felix treats people is in any way okay, please read about healthy relationship behaviors because I promise that you do not deserve to be treated like how Felix treats essentially everyone in this novel.Despite all these complaints, there’s a small chance I may read Rooney’s next novel anyway just because of the quality of her writing. The novel poses an interesting overarching thematic question of whether it’s okay to focus on friendships and relationships when the world is collapsing, however, I wish that the characters in this novel were actually better developed to allow for a more robust exploration of that question. I’ll end this review by saying that there are several books written by women of color about women of color who actually grow and heal in messy yet beautiful ways, and it’s oppressive that these books don’t receive as high ratings or as many ratings/reviews as Sally Rooney’s books. You can find examples on my Goodreads shelf, though I’ll recommend a few here: \n  You Exist Too Much\n by Zaina Arafat, \n  A World Between\n by Emily Hashimoto, and \n  When We Were Infinite\n by Kelly Loy Gilbert.Well, well, well.Look what the cat dragged in.My limited and rarely tested abilities to write a five star review, ever decaying and decreasing from lack of use. We meet again.I will continue to make my own lack of skill the audience for this review, just for a moment, because this is a special occasion. This isn't just any five star book, although that would be a fairly once in a blue moon event as well.You and I - you, of course, being my minimal talents - need to get it together.This is a SALLY ROONEY book. And not just any Sally Rooney book, but possibly my FAVORITE Sally Rooney book. Could very well be my favorite book by who is likely my favorite author, in other words. Rooney has published one excerpt, one essay, three novels, and four short stories, and I have read her work 22 times, in total.Also notably, there is a book I have called the following:- my Bible- the book of my heart- my literal and figurative self, distilled into pages- my most recommended book- my favorite book of the last 150 years- nearly my favorite book of all time, second only to Alice's Adventures in Wonderland- my comfort book- the closest thing I have to a religionIt's a book called Conversations with Friends, it's also written by Sally Rooney, and it seems to have been dethroned by this one.There's a reason I've put off writing this review for two and a half months. The stakes are f*cking high.So where do I go from here?I can tell you that, so long as I live, I expect never to encounter writing like this again. Writing so clear and lovely, writing that summons new images and thoughts and emotions you've never considered and acts as a kind acknowledgment of the scariest and deepest and truest ones you quietly have.I can say that this book begins with a launch, a tossing into the pool, an unceremonious jumping in that's more like a continuation, an assumption you've been there all along. That though it begins suddenly it feels like coming home.I can note that these are some of Rooney's best and worst love stories, the ones you root for the most with the most complicated and \"bad\" and problematic people populating them, and that it's so beautiful to have those two things coexist.I can attempt to work out my feelings about these characters, that while I feel for them and am fascinated by them and may adore them, it's almost beside the point of everything else. That for me, a person who reads for characters, the characters are wonderfully done and the realest yet, and the least important part, for me.I can add that this is also an incredible act of bravery by Rooney, that it serves a huge leap in scope and in style and in intention from her previous books, that she has been criticized for much of her still-nascent career in a way that feels mean-spirited by the aging totems of Literature, and that instead of ducking her head and conceding to the characterization of her work as vapid and millennial, she filled her third book with so much heart it's hard to fathom.I can try to describe what this book means to me, what it's like to spend most of your life trying on cynicism like a Halloween costume, scratchy and seamy and not quite right, to indulge in pithy \"I hate everyone\" negativity when people seem to be the only real reason life is worth living, and then have your very favorite author - who, it may have been mentioned, holds a fairly outsize role in your heart and mind - tell you she thinks so, too. I want you to know, and I can try to convey, that love and friendship are all that matters, and that this book is the loveliest way of giving yourself the gift of letting yourself believe that.I will try to tell you so many things if they get you to read this book.Bottom line: This is a once in a lifetime one, for me.-----------------noteas if i needed more reasons to find this book completely perfect: free palestine-----------------reread pre-reviewthe first time i read this, i finished it in a sitting.the second time, i savored every word.review to come / 5 stars / more if i could-----------------reread updatesi don't know how long i can go without rereading a sally rooney book. but i'm not willing to find out-----------i wish i could say this was as good the third time...but i can't.it's better 😈-----------it is a beautiful world after all(because finally i'm doing a sally rooney buddy read with lily again)-----------i promise i resisted rereading for as long as i could.-----------------release dayhappy release day to the perfect book-----------------pre-reviewsally rooney is the only person alive who can take me out of a reading slump and put me back in one day.review to come / 5 stars-----------------currently-reading updatesdepressed and hungover. this book is going to eat me for breakfast.-----------------tbr reviewnot to be dramatic but this book's announcement is currently the most exciting thing in the world to meupdate 4/13: COVERCOVERCOVERupdate 9/4: thank you, book of the month, BECAUSE MY COPY IS HERE!!! IT'S HERE!!! IT'S HAPPENING!!!I am writing a Sally Rooney novel. I am typing on my MacBook Air purchased in 2019, which came packaged in clean, white boxing. I am writing on a word processing programme, staring at the white, blank page before me. My fingers tap the keyboard noiselessly. I am wearing a crinkled, old sweater. There is a bit of a plot. By which I mean, there are scenes. Sometimes, they even become events, or arguments between characters. But this is quite rare. There is something clinical about my narrative voice, a lack of true emotion in the writing. This is not to say that I do not have interesting things to say about art and life and success and whatever. It’s just that there is no verve, no personality to the words. Just a lick of detached, anemic prose. I also vacillate between using paragraph breaks and forgetting they exist entirely. My characters are often expressionless and do not respond to questions. They do not react to others and keep silent in the face of a seemingly normal conversation, then later say they want to throw themselves out of windows or cry or smash a wine glass on the floor. The number of times they ‘say nothing’, or speak ‘in a flat tone’ is immense. They live in a weird, uncanny valley of human existence. /Last night I had sex with someone I’ve known since primary school. We went to different universities. He was always perfect and tall. I was always awkward, and had no friends. But I am not ugly. In fact, I am quite good looking. I am skinny, and maybe have blonde hair. But for some reason I had no friends, and will continue to drive home this point without explaining why, exactly, nobody wants to be friends with a skinny, beautiful girl such as myself. Anyway, having sex with my childhood friend was interesting. It might be exciting, or awkward, or a mixture of both. But you will not really be able to tell, because I cannot muster the energy to tell you about it in an engaging and varied manner. Instead, I mostly describe sex as though it were a science textbook about mammal reproduction and use same few descriptors to pepper the text every time a sex scene occurs. Which is very often. The sex was awful. But also good? He ran away with a beautiful twenty five year old the next day. Her red blouse fluttering in the wind. Clear eyes. The sea is in the distance. I looked out the window, smoked a cigarette, and thought about the late Bronze Age collapse, for no discernible reason at all.I don't know what it is.All of you scratching your heads about the success of this book and Normal People... I get it. I was actually somewhat irritated by Beautiful World, Where Are You. The characters were annoying, often outright obnoxious, deeply pretentious in their philosophical musings... kinda like, as I said in my review of NP, \"John Green for adults.\"And yet... I found them weirdly fascinating. \"Like\" is not the word I would use for this book, but I was very interested in it. I wallowed in the characters' extremely depressing personalities, cringed at every awkward conversation (and there were, indeed, many), and cared whether the two love stories would work out. The story is about four people in their late twenties/early thirties having, navigating and talking about sex and relationships. Throw in some philosophical discussions and you basically have the plot of the whole book.But something about this author's writing really gets under my skin and plays on my anxiety. Something in the awkwardness, the things left unsaid, the conversations not had and the people unwilling to open up and risk getting hurt. And the people willing to. I read with this hard lump in the back of my throat.Don't ask me to explain why I was so into a book where the characters nod, blink, smile faintly, stare in silence and exchange glances multiple times on a page. I have no explanation. But if Rooney's growing popularity is anything to go by, I can't be the only weirdo out there who falls for this crap.A mature departure from her previous work, BWWAY is exactly the novel we need right now from one of the world's most promising and impressive authors. Rooney's characteristic style glimmers amongst fascinating conversations (sans quotation marks) about climate anxiety, class-consciousness, and language. Ultimately, though, it's personal relationships, communication, love, and sex that the characters must navigate, as they desperately try to identify beauty in their everyday encounters. Alice is a successful young novelist, which allows Rooney to discuss her own space in the landscape of contemporary novel-writing. Are books about sex and relationships really just unimportant, privileged, inane frivolity? Or has the past year of lockdown and isolation made us realise that, actually, communication with the people we love is integral to our daily lives, and worth exploring in literature? This book is testament to the latter.BWWAY is Rooney's most natural integration of profound, intellectual, and elevated conversations amidst the dazzling ordinariness of her flawed, imperfect protagonists, and the exquisite precision of detail in this book is truly masterful. It's believable, perceptive, and a treasure of a book. Possibly her best yet.Watch my full reading vlog here: https://www.youtube.com/watch?v=iEUAA...[Thank you to Faber for my advanced copy of this book -- all opinions 100% my own]She’s back! In Beautiful World, Where Are You we follow Alice, Felix, Eileen, and Simon through the ups and downs of life including their friendships and relationships with each other. Rooney grapples with many questions in her newest novel, from the various definitions of success to how one finds hope in an oftentimes hopeless world, all with her trademark emotional and thoughtful prose. If you loved her others, you will love this one, too. It’s pure Sally Rooney.well she’s done it again, I think it’s her best when i was diagnosed with covid i thought that being isolated to my bedroom for two weeks was the most boring thing in the world - Sally Rooney has now proven me wrong. reviewed this in a twitter thread so i'm transplanting that herethe tea? i think it’s good. i think sally has managed to ‘mature’ her writing very successfully. also, sally has jokes! a good alternative title would be Sally Rooney’s Surprisingly Down to Earth and Very Funny.fucking hell is it bloated however, like a corpse pulled from a river. at 337 pages, rooney’s style is absolutely max’d out and her ‘solid blocks of text’ approach to prose feels like an absolute punishment in some sections.the whole Sally-masquerading-as-Alice stuff is immensely trite and far too cringe for me. like, we get it sally, your life is terrible but you’re also a millionaire so maybe read the room?yet the relationship between Alice and Eileen is her strongest yet. and it’s how we slowly discover more about their lives and how everything slowly unfolds that the novel really wins me over.obviously it isnt normal people, and i applaud her writing a novel that just SO ISN’T normal people lmaonever however have i been so sure that a novel will absolutely win over critics but may die in the hands of the readers.i will say i am one of the few voices in my extended group who will outwardly say that i think it is good. which is strange, especially for me.it is a rough beast. but i’m looking forward to revisiting it relatively soon.i am not the same person i was before this book.Beautiful World, Where Are You opens with Alice, a novelist, meeting Felix, a warehouse worker. She asks him if he wants to travel to Rome with her. In Dublin, her best friend Eileen is getting over a break up and slips back into flirting with her childhood best friend, Simon. In this beautiful world, Alice, Felix, Eileen and Simon navigate sex, friendship, relationships and the intricacies and complexities of the world they live in. \n  \n    “Maybe we’re just born to love and worry about the people we know, and to go on loving and worrying even when there are more important things we should be doing. And if that means the human species is going to die out, isn’t it in a way a nice reason to die out, the nicest reason you can imagine? Because when we should have been reorganising the distribution of the world’s resources and transitioning collectively to a sustainable economic model, we were worrying about sex and friendship instead. Because we loved each other too much and found each other too interesting. And I love that about humanity, and in fact it’s the very reason I root for us to survive – because we are so stupid about each other.”\n  \nI knew before I even started reading this book that I was going to love it. Heck, when it was announced I knew I was going to love it. There was absolutely no doubt about that. I adored Normal People and Conversations with Friends so much, and upon rereading them, I fell in love with them all over again. I was lucky enough to receive an early copy of this book and when I say that’s the best thing that’s happened to me this year, I don’t mean it lightly. I devoured this book. I read it within one sitting because I could not put it down and couldn’t go on without wanting to know what was going on in all of the character’s lives. I think Sally Rooney is incapable of writing a bad book and I’d go as far as to say that this is her best one yet, although I don’t know if that’s just the high I was feeling talking once I finished it. For fans of Sally Rooney’s earlier work, you won’t be disappointed. It’s a mix of both Normal People and Conversations with Friends whilst simultaneously feeling like a more mature piece of work.\n  \n    “At times I think of human relationships as something soft like sand or water, and by pouring them into particular vessels we give them shape. So a mother’s relationship with her daughter is poured into a vessel marked ‘mother and child’, and the relationship takes the contours of its container and is held inside there, for better or worse. Maybe some unhappy friends would have been perfectly contented as sisters, or married couples as parents and children, who knows. But what would it be like to form a relationship with no preordained shape of any kind? Just to put the water out and let it fall.”\n  \nOne of my favourite things about Rooney’s novels, and what I found especially fascinating about this one in particular, is her characters, the dynamics and interactions between them and other people, and the way they behave and are characterised. All of her characters in this one, Alice, Eileen, Felix, Simon, they all felt so real and authentic, even if that meant they were a little unlikeable at times (I’m looking at you Felix.) But is it a Sally Rooney if the characters don’t rub you the wrong way at times? Although I’m surprised to say that I actually didn’t dislike the characters at all, even if Felix got on my nerves at the beginning he became better throughout the novel. I felt such a connection to the characters, rooting for them as if they were my own friends. I wanted Alice and Felix’s relationship to succeed, just like I wanted Eileen and Simon to finally get together, with the same intensity I felt for Connell and Marianne in Normal People and Frances and Nick in Conversations with Friends. Like I loved these characters so much, individually and together, especially the friendships they have and the relationships they form.\n  \n    “Aren’t we unfortunate babies to be born when the world ended? After that there was no chance for the planet, and no chance for us. Or maybe it was just the end of one civilisation, ours, and at some time in the future another will take its place. In that case we are standing in the last lighted room before the darkness, bearing witness to something.”\n  \nLike I said before, it’s not a Sally Rooney novel if you don’t dislike the characters at times and although I actually really loved the characters, they still annoyed me at times, especially Eileen who just couldn’t admit that she wanted to be with Simon! It was so frustrating watching her push him away when she couldn’t admit that she wanted him. And it annoyed me. But I loved how much it annoyed me because I truly wanted these characters to be happy. Is that weird? It’s probably weird. Same with Alice and Felix, who had this weird sort of unhealthy relationship at times where they tried to hurt one another, more Felix than Alice, which ultimately came from a place of insecurity. But what I loved about this book is that everything is addressed, the characters, although at times miscommunication is prevalent in their interactions (would it be a Sally Rooney novel if it wasn’t?), they talk to one another and work through their issues, and the author manages to capture that awkwardness, vulnerability and layers of insecurity perfectly within those interactions between characters. But I’m really happy with where the characters ended up and that we actually got a pretty solid and defined ending which is pretty rare for Miss Rooney. Is she feeling okay? After I finished, I felt really happy and satisfied and was wondering what the hell was going on.\n  \n    “It’s still better to love something than nothing, better to love someone than no one, and I’m here, living in the world, not wishing for a moment that I wasn’t. Isn’t that in its own way a special gift, a blessing, something very important?”\n  \nWith every novel, even the ones you absolutely adore, there are going to be aspects that you didn’t particularly vibe with. For me, the emails between Alice and Eileen were a little pretentious and often a little too much. I struggled to concentrate on them, especially when they’d go into some deep intellectual rant but this was more at the beginning of the novel and they got easier to follow throughout. The one thing I absolutely loathed though was the introduction and inclusion of the pandemic and lockdown into the plot. I read to forget and I really don’t think it was necessary to include it at all. I understand Rooney’s novels do contain references and allusions to things that have happened in the real world but they are subtle and not in your face. This felt so intrusive and it felt too jarring and took me out of the story. Also, I know that Sally Rooney had been working on this book since 2018 so I absolutely know that the inclusion of the lockdown was just worked into the plot for whatever bizarre reason.\n  \n    “Eileen put her arm around Alice’s shoulders. If you weren’t my friend I wouldn’t know who I was, she said. Alice rested her face in Eileen’s arm, closing her eyes. No, she agreed. I wouldn’t know who I was either. And actually for a while I didn’t. Eileen looked down at Alice’s small blonde head, nestled on the sleeve of her sweatshirt. Neither did I, she said.”\n  \nAnother glorious thing about this novel, that wasn’t as much of a present topic in Normal People or Conversations with Friends, despite the queer characters in the latter, is the frank and honest conversations about sexuality. Felix is bisexual, or pansexual? He states that gender doesn’t really matter to him. And Alice is bisexual. And the conversations that they have with one another about this were really refreshing to read about, exploring biphobia, and experiences of falling in love that have nothing to do with gender. And Alice’s explorations of the meaning of sex and sexuality in her emails to Eileen were also very interesting to read and its what made this book even better for me.\n  \n    “I was tired, it was late, I was sitting half-asleep in the back of a taxi, remembering strangely that where I go, you are with me, and so is he, and that as long as you both live the world will be beautiful to me.”\n  \nOverall, Beautiful World, Where Are You is truly a beautiful work of art. I would go as far as to say that it is Sally Rooney’s book yet. I need her to keep writing books, because I just can’t get enough. I love the characters she creates and I love watching them interact and love and hurt and grow and prosper and succeed and thrive. The experience of reading this was really enjoyable and I wish I could erase my memory so that I could read it all over again for the first time. sally rooney has a new book coming out? i can't wait to love and hate these characters all at the same time.5/5 but you all knew that as soon as i opened the coverPeople have feelings about Sally Rooney—strong feelings—in a way they just don’t about other writers. The oversaturation of positive attention itself generates negative responses, ranging from the mildly baffled ‘why the hype?’ to the exasperated ‘can I just stop hearing about Sally Rooney for five seconds!’.For me, Conversations with Friends was good, but not brilliant. Normal People I loved (any novel that can make me ugly cry has earned its 5 stars). The TV adaptation of Normal People I super loved, and Rooney deserves due credit for that too.This is a long-winded way of saying that in the polarised world of Rooney-commentary, I’m not really on either team. I wasn’t predisposed to feel any kind of way about Beautiful World, Where Are You. As it turns out, I didn’t care for this one much, but I’m almost loath to criticise because of how personal Rooney gets here—about the dissociative effect of sudden fame, the spurious value of writing about her own life: ‘If novelists wrote honestly about their own lives, no one would read novels—and quite rightly! Maybe then we would finally have to confront how wrong, how deeply philosophically wrong, the current system of literary production really is—how it takes writers away from normal life, shuts the door behind them, and tells them again and again how special they are and how important their opinions must be.’Rooney is now three novels deep in what appears to be a project to update the Austen-style marriage plot for the 21st century. Her stories don’t hinge on the actual legal institution of marriage, but rather the ‘love match��� that was Austen’s staple. I think it’s part of Rooney’s enigma that she manages to be wildly popular for doing something so seemingly unfashionable. For such stories to work, you need exemplary characterisation. As a reader, you want to be invested in the outcome and for that the characters have to seem real. It’s fine for them to be unlikeable; it’s a problem when they are unconvincing and uninteresting, and that was my main issue with BWWAY. Three separate narrators—a third person objective POV; Alice (via emails); and Eileen (also via emails)—all write with the same hyper-observant, analytical, detail-oriented style. The characters all speak in the same faux-profound, excessively candid way, divulging their deepest truths to near strangers, while also being completely inept about expressing their romantic feelings (as necessary to defer the plot’s resolution). None of it rings true. There are moments of brilliance in the writing. I particularly liked a cross-cutting or ‘split screen’ effect employed by Rooney to narrate two separate strands of action happening concurrently. But without that all-important connection to the characters, I was never fully drawn in. Of the three, this is the Rooney novel I've enjoyed the least.‘As long as you both live the world will be beautiful to me.’The release of Sally Rooney’s Beautiful World, Where Are You is about to be a literary event for 2021. Not only with many people clamoring for more Rooney, but for the discussions this novel is bound to spark. Taking its title from a Friedrich Schiller poem, the book follows four characters—Alice, Eileen, Felix and Simon—as they muddle their way through their late 20s/early 30s looking for beauty in life while inflicting themselves upon each other. This is a novel of discourse created through imperfect arguments and opinions by flawed characters because the world is imperfect and people are flawed. It is her most ponderous yet with will-they-won’t-they relationship tension that serves less as a plot device and, ultimately, more as an opportunity for discourse on society, gender, power, and the timeless struggle for meaning in life all while Rooney gives a passionate plea to live with forgiveness, understanding and love.‘What is these things just rise and recede naturally, like tides, while the meaning of life remains the same always—just to live and be with other people?’Rooney tends to garner strong opinions about her works which have also crossed into criticism of the author herself and the state of modern literature as we know it. There have been frequent articles following her books declaring her the harbinger of the decline of the English novel, usually also citing Zadie Smith, something that tends to occur when an author finds a way to write literary works that are also very popular. Love her or hate her, Rooney is a major figure in the modern literary scene which, I feel, is something that benefits from inclusion over gatekeeping. ‘A perfect example of o]ur shallow and self-congratulatory ‘book culture,’ Alice writes late in the novel, ‘in which non-readers are shunned as morally and intellectually inferior, and the more books you read, the smarter and better you are than everyone else.’ I think this could extend to ‘types’ or readers, and something I think is important, particularly in Librarianship, is to acknowledge that not everyone reads for the same reason and not all books are written for the same purposes. Rooney is able to write literary books that appeal to those drawn into volatile relationship drama and use these relationships as a vessel to examine a vast array of socio-political, interpersonal and mental health issues. And she does so quite successfully. In BWWY, Rooney seems to address many of her critics head on, cleverly voiced through her two protagonists, Alice and Eileen. Though it is not as simple as them being mouth-pieces for the author and an early statement from Alice, a popular novelist with a circle of harsh critics that seem to have been emboldened to dislike her due to early, glowing reviews about her books (sound familiar?) reminds us not to make the intentional fallacy and assume all statements are 100% the Author. Depiction not necessarily being endorsement and all that discourse. Yet it still feels pointed at the older [white male] critics when Eileen theorizes ‘remembering is weaker than experiencing…middle-aged people always think their thoughts and feelings are more important than those of young people.’ Many of the arguments put forth by Alice tend to come across as defensive, and says modern fiction suppresses real life because she believes they think ‘to put the fact of that poverty, that misery, side by side with the ‘main characters’ of a novel, would be deemed either tasteless or simply artistically unsuccessful,’ it feels like ignoring a wealth of fiction that already exist exploring themes of poverty and the political quite successfully. This may serve, however, as an example of the ‘moral superiority’ Felix accuses her of having (women tend to face far more criticisms for their behavior than the men here), which becomes a major theme in the novel. Or I’m being generous, but I predict this passage will be frequently used in many critics assessment of the book). What drives this novel is the dialoguing that occurs, through which Rooney tosses up a lot of conflicting philosophizing and disagreement between characters and let’s them hash it out. This works to the novels favor, and Rooney is a master at dialogue that feels real, complete with humor and sharp jabs such as when Elieen texts Simon ‘Why do men over 30 text like they’re updating a LinkedIn profile?’ Half of the novel is epistolary with Alice and Eileen exchanging emails that follow the rotating narratives about them in their separate worlds where Rooney gives herself the opportunity to have them discuss at length everything from capitalism and climate crisis to the downfall of the Late Bronze Age. It’s a fun technique and may seem heavy handed but one only need to read the emails of any English major to their best friend to see, oh yea, we really do that (I apologize to anyone who has ever had an email from me). It might be nitpicking, but there isn't much attempt to at crafting two different voices between Alice and Eileen here.'In my deepest essence I am just an artefact of our culture, just a little bubble winking at the brim of our civilization.'The authorial voice is interesting in this regard, being highly textured and moving from a rather distant third-person account that rarely enters the characters minds and lets us simply watch, to highly personal emails. She excels at pacing, speeding up or slowing down to highlight details like a finely tuned machine programmed for maximum plot tension and exposition revelation. Occasionally the 3rd POV seems intentionally elusive, like Alice telling Felix ‘about a friend named Eileen’ long after we know who Eileen is which serves to remind us of the distance between lives even among friends. The distance of the narration allows us only to observe, never be in their minds, furthering the theme that asks us why we judge people without actually really knowing them inside. The characters may be frustrating, but they are their own people with private lives and 'you'll only drive yourself crazy trying to make them act the way you want.' Sections that narrate what Felix is doing alongside what Alice is doing often are used to show the contrast between social classes, with Simon working long hours warehouse while Alice drinks tea and checks emails. It almost mocks the importance artists place on art as we know Alice is a millionaire and Simon is in debt, something Rooney furthers when she says famous authors are less concerned with life and more ‘obsessed with whether their latest book will be reviewed in The New York Times.’ Rooney has fire in this book and lots of blows tend to land on the publishing industry and against idolization culture.‘Like Alice in her moral philosophy, she was caught between two positions. Maybe everyone was, in everything that mattered.’In a recent essay, Brandon Taylor talks about moral fiction as something that ‘is not ideologically precious or rigid—it simply portrays the complexities of what it is to move through the world with that ever-evoked ethic of the online: nuance.’ Nuance abounds here and no topic walks away unscathed. Arguments ensue and Rooney has created a space to explore multiple angles of topics without having to pass some authorial judgement on the opinions, leaving the reader to decide for themselves. In a discussion on Marxism, one character opines that identity is merely the latest fashion after another says being working class isn’t a fashion statement but an identity (reminding Eileen of the irony she drives her parents BMW calling herself a Marxist). There are arguments over if beauty can exist in a cosmetic world, if it is ethical for Simon at 30 to date women 10 years his junior (recalling the relationship and power-dynamics of sex from Conversations with Friends). Taylor warns against literature flattening morals to a ‘Twitterfied set of ethics’ and the way this book will likely raise eyebrows over ideas as a big part of its theme.Central to this book is the notion of moral superiority, something that seems prevalent in our online culture. ‘We hate people for making mistakes so much more than we love them for doing good,’ Alice writes, ‘that the easiest way to live is to do nothing, say nothing, and love no one.’ What initially feels like a tired complaint about ‘cancel culture’ turns into something much more interesting about passing judgement on others, particularly as Alice is the one who faces most accusations of acting morally superior to others. By allowing the reader to make up their mind about the characters, Rooney asks us what leg we have to stand on in judging them. ‘What if its all of us,’ Alice asks when considering who has done harm to others. There is a certain Catholic aspect to her novels, such as Simon being the only church going member of the book but he is set up as if he were a Dostoevsky villain grooming Eileen since she was 15 (much like Luzhin in Crime and Punishment he uses being a hip political figure and his vast bank account as a means to have sexual access to many young women, not unlike Nick in Conversation using his youth-passing good looks to have an affair with a University student). While ideas of purity and Catholic guilt kept Connell from sexually pleasing Marianne in a rough way as she wished in Normal People, here Rooney asks if we have created a new set of moral purity demands through online culture that has taken away our means for forgiveness and separates people instead of community building.This aspect of the novel is sure to spark debate, especially when many of the examples used tend to be sexual. This all leads to an examination of what it means from the Biblical story of the sinner woman washing Jesus’ feet as a message of ultimate forgiveness. Characters discuss how, as atheists, why do they place so much emphasis on there being no divine morality and then still demand a moral purity from others. Rooney also discusses this in the way we treat celebrities, how people will pass judgement on an author without ever knowing them, confusing ‘someone’s name they know with someone they know.’ While I’ve seen this same Biblical passage weaponized in US religious culture to protect the powerful from consequences, I see what Rooney is getting at and while it is imperfect, so is life. Also perhaps this is a depiction of the ‘hot take culture’ of social media? Though I would prefer the focus to be on those who have been harmed rather than worrying about the feelings of those who harm, I suppose her point is that everyone has complex emotions. A common complaint of her books is that the characters are unlikable, though I feel like liking them is not the purpose but rather understanding how they self-justify and seeing the way their actions affect one another. We are all searching for a beautiful world.But can we even know what beauty means in a world that substitutes the term for cosmetics, as Eileen points out? Have we filled the world with ugly faux meaning, supplanting purpose with marketing? Has the use of plastic distorted what we can even possibly understand about beauty (Eileen again), and in a capitalist world that only values profit how much can individual purpose even matter. If Eileen doesn't make as much money as Alice or her sister, is her job less meaningful? This is the landscape across which the friends navigate their relationship woes on their quest for a beautiful world. Rooney pitches that, perhaps, it's about being thankful for what we have, and content with the love we find.‘As life in its ordinariness and even ugly vulgarity imposed itself everywhere around them...were they somehow invulnerable to, untouched by, vulgarity and ugliness, glancing for a moment into something deeper, something concealed beneath the surface of life, not un-reality but a hidden reality: the presence at all times, in all places, of a beautiful world?’If you haven't noticed, this book is sort of messy in the most glorious way possible. It is not plot driven and sort of slowly moves around from idea to idea and does so successfully. It feels a bit bloated at times and perhaps this is a combination of a publisher ask for a larger page count to justify a $28 hardcover and Rooney having proven herself enough that an editor isn’t going to cut content (just spitballing here), but this isn’t a detriment although it doesn’t feel as tight as her previous books. In fact, I sort of prefer it this way and each scene and idea is given room to breath and spiral around with the others, returning from time to time to solidify her points. The novel ultimately becomes a bit overly a will-they, won’t-they, but Rooney reminds us this isn’t the point. ‘Do the protagonists break up or stay together? In this world, what does it matter?’ Alice writes, ‘we can care…if and only if we have successfully forgotten about all the things more important than that, i.e. everything.’ The friendship plot was more interesting to me than the coupling, but I see the purpose of its draw. Rooney has matured as an author and has taken on a bold and daunting task of incorporating all her themes into a big novel on social relations using her four characters as a microcosm and, for the most part, pulls it off. After more people read this I'd like to come back and talk about more specific aspects, but for now, enjoy this book. I suspect Beautiful World, Where Are You?' will be the subject of many articles coming from many strongly held beliefs, and that is exactly what Rooney has set out to do.3.5/5'It's still better to love something than nothing, better to love someone than no one, and I'm here, living in the world, not wishing for a moment that i wasn't.'I don’t know the main reason I am drawn into this book so deeply!  It’s not five starred read for me and I don’t want to compare it with Normal People because it feels like making comparisons between two things in completely different categories. Yes the characters are truly annoying but interestingly connectable. I don’t know why I got so interested to read about their somewhat too philosophical, honestly complex, a little long, semi- satisfying, somewhat unfinished, complicated, unresolved conversations about love- sex-commitment- relationships! I think Ms. Rooney found the way to trigger something about my past: the anxious, lost times I’ve been looking into my own life path, criticizing my own mistakes, dealing with those depressing thoughts. She truly force me trip down my memory lane. If this was another author’s book I would automatically give three stars because of dislikable characters and their rambling inner thoughts. Well, thankfully this is brilliant author’s book and after reading some chapters I truly needed extra time to digest some feelings. I still do. I’m looking at the blank walls. I keep sighing.  I think I need a drink. I need to gather my thoughts. I will write an extended review but so far I must say: I enjoyed this book so much. Now i have to find the main reason why I connected with the story!Follow me on medium.com to read my articles about books, movies, streaming series, astrology: medium bloginstagramfacebook twitterwhat did I just read...Update: Wow!!!Rooney won’t ‘allow’ this novel - her 3rd to be translated in Hebrew because she supports a cultural boycott in Israel. Her past two books ‘were’ translated in Hebrew. A SAD DISAPPOINTING CHOICE IMO!!! I’m Jewish. — Antisemitism has been on the rise in recent years — Learning this information- has a disturbing divide aspect that I feel is sooooo unnecessary- This is a BOOK — a literary contemporary novel. The parts of this novel that I wasn’t enthralled with — comes from the same core place that doesn’t enthralled me to learn this information about Rooney. She has the right - I’m just NOT A FAN OF HER STAND! Readable … ….but disappointing. For me, I felt this novel was trite, uninspiring, and lacking in depth of the very topic which was at the heart of the matter. 2.5 - it’s a stretch for me to give it three stars… but I’m still thinking about it and there are things I’d like to discuss with others — so three stars it is.Beautiful World, Where Are You focuses on two women, Alice and Eileen, who are best friends. They are both 29 and are still trying to find their way in the world, primarily by finding life fulfillment by engaging in dating relationships and pursuing conversations about politics (all the while not actually doing anything). Never reading a Sally Rooney book before, I saw all of the hype and had serious FOMO so I pre-ordered a copy. The beginning of the book was quite entertaining and filled with sharp, smart witty humor. However, it had more steamy scenes than erotica. For all of the progressive talk, the book only focused on two heterosexual relationships. What exactly did Alice see in Felix? What about him was so great? Rooney also tries to romanticize having unprotected activities, but HPV and The Clap don't wash off in the morning especially when the couple engaging in said activities are not in an exclusive relationship. Again, if you are going to put forth a book about forward thinking, then the actions should match the philosophy. Also, this book subscribed too readily to stereotypical gender roles with males being the providers, and the women being hysterical and overly emotional who largely don't get what they want because they won't articulate their needs. Beautiful World Where Are You does tackle some of the weightier issues in the world presently. With dating moving to the online world, there are now infinite choices, and how can the daters really know if they are in a committed relationship? Why do couples want to have more children with the pandemic uncertainty as well as the increasing pollution levels? There was one part of the book that confused me because Alice was complaining about how she is all alone in the world being a famous author and how she had no one to show her the way. In the last half of the book, Alice speaks about how she has all of these author friends. Now which is it? Overall, Beautiful World Where are You was an entertaining read. If you hate erotica or liberal ideals, you will want to steer clear.2023 Reading ScheduleJan Alice in WonderlandFeb Notes from a Small IslandMar Cloud AtlasApr On the RoadMay The Color PurpleJun Bleak HouseJul Bridget Jones’s DiaryAug Anna KareninaSep The Secret HistoryOct Brave New WorldNov A Confederacy of DuncesDec The Count of Monte CristoConnect With Me!Blog Twitter BookTube Facebook InstaI am well aware that the Irish writer Sally Rooney has legions of fans, although the hype for this novel feels rather overblown. This is one of those reviews that I am uncomfortable writing, I know many readers loved this, I just didn't connect with it. It's not that I hated it, it's more that I was indifferent, to the characters of the successful writer, Alice, her best friend, Eileen, warehouse packer, Felix and Simon, the relationships and interactions with each other. To me, they came across as medicated, laboured and labouring, masquerading as real people, with little depth. I suspect my response to this novel comes from having read such exquisite and more impactful books recently, such as The Love Songs of WEB Du Bois by Honoree Fanonne Jeffers. I would suggest that readers read other far more positive reviews before making the decision to read this, it may well be that I am just not the target audience for this novel.how incredibly kinky. the world is decaying, our purpose is meaningless, lost, and inconsequential. most of our fleeting exsistence is spent questioning and assigning meaning to things we don't understand but fuck it!! i want a boyfriend. i want to get fucked whilst the world begins to rapidly rot around us. the hilarity of this book trying to grapple with such complex concepts while remaining incredibly vapid was almost, strangely, endearing. and to answer the question that the title poses, i think the beautiful world is in us. in our love for eachother, in our passion, in our continuation of this strange, frustrating thing we call life. I would give this book zero stars if I could.I found this book as insufferable as Conversations with Friends. I mean no disrespect to Rooney nor to anyone who liked it, but her writing is so pretentious, her characters so unlikable, and her overall style so entitled, self-absorbed and self-indulgent, that everything she writes makes me want to wash my eyes with soap. Her literary \"alias\", Alice, claims to be uncomfortable with fame. She complains, complains, and carries on complaining. Where's the real plot? Where's the character development? Rooney herself, in an interview with the Guardian just a few days ago, compared fame to \"hell\" (https://www.theguardian.com/books/202...). I found it sad and enraging, and I was shocked by her entitlement. People in her country are working 12 hours per day for minimum wage, barely making it. People her age, with plenty of ambition, work in unpaid internships or underpaid jobs - not because they're not talented or educated, but because they were not as lucky as she is. She can obviously complain about the invasion of her privacy and other aspects of fame. BUT.... BUT she is profiting off of her own privilege, pretending to be \"in hell\" just because a few journalists ask her some personal questions. Give me a break. I am a millennial too, and I am ashamed that her books have been branded as \"books about millennials\". We don't deserve that.But back to the book review. I don't have much else to say. The characters were shallow, privileged and boring (understatement of the year), the conversations pretentious and not at all realistic, and don't get me started on the email exchanges. The male characters were terrible, but so were the female characters. It basically felt like a copy-paste of Conversations with Friends. Every character was like a variation of the same person, to the point that their individual stories and voices felt pointless. I can honestly say that I managed to finish the book only because I wanted to be 100% sure that my review would be accurate. And it is. I would give this book zero stars if I could. Rooney produced ONE slightly good thing in her career, i.e. a book (Normal People) that allowed *real* screenwriters to transform her flat characters into full characters portrayed by excellent actors in the tv series. I truly believe that she got lucky: had it not been for the excellent cast of Normal People, she would not be considered a good writer. I think she should enjoy her initial success and stop trying to publish the same book over and over again. At some point, everyone will realize that she doesn't have anything new to add to the literary world and that she is just trying to profit off of her TV adaptation success - while saying that \"fame is hell\". PLEASE. Enjoy your money and spare us the white middle class \"oh, but I'm Marxist and I suffer and my characters make terrible choices and deserve empathy\" spiel. Overall, I thought I'd give BWWAY a chance, that maybe she'd evolved, but....no. Just my opinion. I respect everyone who liked it! [Review of an ARC]\n  \n    “and I love that about humanity, and in fact it's the very reason i root for us to survive - because we are so stupid about each other.””\n  \nit comes as no surprise to anyone that i would rate this five stars. this may very possibly be my favorite sally rooney, even over conversation with friends (maybe not)(i said very possibly, not that it is so don't hold me against it)(i have to reread conversations to make a wise and educated decision).beautiful world, where are you explores the relationships and dynamics between four people: alice, eileen, simon, and felix. what i love about rooney’s writing, and loved about this book, is that rooney writes the romance between characters as more of a psychological exploration into human relationships and its various dimensions. rather than writing her novels in a ‘classic romance’ sense, with trite ideals and love interests placed on sky-high pedestals, rooney writes a more grounded, realistic depiction of love and all the joys and turmoils it entails. this is definitely rooney’s most ambitious novel yet; she not only tackles the complexities of relationships with her usual sophistication and sharp wit, but also ventures into an epistolary series of historical anecdotes and social commentary through alice and eileen’s email correspondence. i think it was stylistically interesting to insert between chapters, but became an instrumental part of the novel. the characters attempt to find the meaning of life through internal self-reflection and introspection, but also various external outlets: relationships, religion, jobs, family. through the emails, rooney explores this on a macroscopic scale and how these struggles are also visible in society. the alternation between email/prose shows the overall scope and scenery of what the modern millennial is living and struggling through while also examining the four character’s specific and personal problems at closer proximity, which i thought was very apt for the vibe novel.while felix is very obviously the weakest link (and the most useless asshole character), i loved how human all of these four characters were throughout the novel. they simultaneously crave and reject romantic intimacy and continuously question their own emotions and intentions. they are also excellent as self-analysis (although it is often their downfall), which makes it more enjoyable to read, in my opinion. all of this is a reflection of how we, in real life, behave, and i loved how well she articulated these feelings in her novel. ironically, her characters do not believe in happy endings, yet the fleeting moments of possible happily ever afters lead us to believe in them too. momentarily. but isn’t that enough?i think this was a great book to read in my early twenties, especially during the pandemic, which has prompted us to question and reevaluate relationships in our own lives, both romantic and platonic—undoubtedly one of the best books of 2022 for me.i went in expecting a beautiful world and this book gave me a soap drama, christian propaganda, and a privileged white woman's political agenda, not that i asked for it.COLLASSO GENERALE DI SISTEMASi può parlare di Sally Rooney evitando di tirare in ballo i millennial - come viene chiamata la generazione di quelli nati tra il 1981 e il 1996 – senza dare o ricevere etichette, senza doversi scontrare e/o confrontare con chi la odia o chi la ama, con chi la trova insulsa e chi invece la trova geniale, con chi la giudica banale e sciapa e chi invece la considera sopraffina, senza parlare dei milioni di copie vendute, di marketing, di next big thing – anche perché lei ormai non è più next, ma semplicemente big thing…Si può?Sì, secondo me si può. Si può parlare di una scrittrice irlandese trentenne che riempie i suoi libri di suoi coetanei, di gente che ha più di vent’anni ma non più di trenta. Di personaggi che sembrano sfaccettature della sua personalità - ma anche no - che modella sulla gente che conosce e i suoi amici - ma anche no – con i quali lei, Sally, costruisce romanzi mai troppo lunghi (max trecento pagine), scorrevoli, dove il dialogo – tanto, e che orecchio sopraffino per le conversazioni! – si incastra alla perfezione con le descrizioni, le virgolette saltano, uno diventa l’altra e viceversa, in un flusso unico che mi prende dalla prima pagina e mi trascina fino all’ultima, con la sua scrittura asciutta e ritmata.Trentenni che non si separano mai dal cellulare (ma perché, lo fanno forse i ventenni o i cinquantenni?), strumento che serve anche a fare telefonate, e svariate altre attività, appendice dalla quale non sembrano allontanarsi mai, e che però Sally Rooney sa rendere presenza pratica e mai irritante. Trentenni che scrivono mail e messaggi, usano app anche per decidere come vestirsi, guidano ma la patente non è più uno status symbol come per le generazioni che li hanno preceduti, parlano tra loro di arte ed estetica e politica e marxismo, si raccontano il sesso anche nei dettagli (quanta è brava la Rooney in questi frangenti!), sono fluidi, sono attratti dall’altro sesso e dal proprio piuttosto indifferentemente.Personaggi che si percepiscono pervasi d’ansia e insicurezza, certo non solo economica, socialmente ed emotivamente instabili, preoccupati per le sorti del pianeta, l’aumento delle temperature, il consumo di carne, in perenne crisi e ricerca, una sorta di paura, o preoccupazione, esistenziale. Ma sono anche autocoscienti come pochi, a volte saccenti a volte irritanti. Sono: umani.Certo, il discorso sui millennial posso evitarlo, ma rimane comunque sottotraccia: la generazione che viene considerata la più istruita della storia occidentale, composta da nativi digitali che parlano almeno una seconda lingua, impera nelle pagine di Sally, come negarlo.Però, com’è e come non è, mi sento millennial anch’io, anche se con qualche anno in più. E mi pare che anche la mia generazione tutta sia millennial: l’ansia, l’insicurezza, l’inquietudine sono più o meno quelle. Sono umane.Perché la mia intelligenza doveva essere una, e forse anzi una sola ne esiste di cui tutti gli uomini sono coabitanti: un’intelligenza sulla quale ognuno, dall’intimo del suo corpo particolare, volge i propri sguardi, come a teatro, dove, se ognuno ha il suo proprio posto, in compenso c’è un’unica scena. [M. Proust]Scrivono mail che sembrano le lettere di una volta, quelle che si spedivano per posta, quelle che si aspettavano con ansia, e si andava a controllare la cassetta della posta, e quando il postino suonava il campanello il cuore balzava nel petto. Mail lunghe, intense, curate, mai sciatte.E leggono e citano Proust, e leggono e citano Henry James, e il mio cuore balza.Il narratore diegetico, mai intrusivo, mai giudicante, si fa ovviamente omodiegetico quando entra in campo la corrispondenza digitale. E se sia più bella la terza o la prima persona nelle mani di Sally Rooney io proprio non saprei decidere.E sì, andando avanti, oltre la metà di questo romanzo che, credo proprio abbia ragione il NYT, è il suo migliore ho cominciato a sentire l’eco del grande irlandese errante, James Joyce e il suo splendido racconto The Dead.Come definire la meraviglia di quella mezza pagina dedicata all’appartamento di Simon alle 20:15 di un lunedì sera, descritto principalmente in penombra ma con il taglio dell’ultima luce del giorno che entra dalla finestra?E poi mezz’ora dopo entra Simon, rientra a casa dopo la sua giornata di lavoro, apre la porta tenendo il cellulare nell’incavo della spalla, mani occupate con le chiavi e lo zainetto, conversazione in corso che non vuole interrompere. E poco più tardi, dopo essersi preparato una tazza di tè col bollitore elettrico, inizia a messaggiare con Eileen, la invita, le manda un taxi (ovviamente tramite app), ne segue sul display il percorso di avvicinamento da casa di lei verso casa sua, e intanto sistema il disordine domestico e si prepara ad accoglierla. E dopo, seduti insieme sul divano, i piedi di lei sulle gambe di lui, la mano di lui che risale dal piede all’incavo del ginocchio, all’interno della coscia a sotto gli slip – Sally Rooney non tace nulla, racconta i particolari, anche quelli più intimi, mai pruriginosa, mai volgare, al contrario, tra candore e pudore.E ancora più tardi, dopo il sesso e le chiacchiere e il vino, quando Simon e Eileen si trasferiscono in camera da letto chiudendosi la porta alle spalle, l’occhio e l’attenzione di Sally Rooney rimangono fissi sul salotto vuoto– lo stesso ambiente che l’aveva catturata all’inizio del capitolo, diciotto pagine prima – e lo descrivono per qualche altro rigo nel corso della notte fino al giungere dell’alba. Incanto e stupore. Meraviglia.So many books I've been looking forward to this year which have been big disappointments. I had such high hopes for this novel, but it ended up being a long slog that went nowhere.I couldn't connect with or believe in any of the characters (the male characters were particularly undeveloped) and the epistolary device didn't work at all; it just felt like a vehicle for Rooney to muse on pseudo-deep ideas. SO many pages of telling and describing the actions of characters and their physical movements (almost as if to help guide a future tv/film adaptation) which did nothing to forward the plot. I am looking forward to hearing what other readers make of this. If we're making direct comparisons to Rooney's previous novels it's definitely more like Conversations with Friends than Normal People in my view: pretentious people stewing over relationships which seem doomed/not worth pursuing from the get-go. The book also felt very auto-fictional to me - the protagonist Alice has written two books which were very successful, one of which has been adapted for tv/film - which was unexpected but also didn't really come to anything beyond us getting a glimpse into the psyche of a reluctantly famous and private author.“What if the meaning of life on earth is not eternal progress toward some unspecified goal—the engineering and production of more and more powerful technologies, the development of more and more complex and abstruse cultural forms? What if these things just rise and recede naturally, like tides, while the meaning of life remains the same always—just to live and be with other people?”Sometimes, when everything happening around me makes no sense whatsoever, I think that perhaps I’m trying too hard to make heads or tails of it all. Maybe it really is something very simple after all, when it comes down to it. Don’t we always come back to the same thing all the time? Civilizations rise and fall, war and devastation occur, but the people still remain. We still go on somehow. Why? Some desire power, fame and money; some could care less. But the common denominator of humanity is love and friendship. We want to be seen and heard on some personal level by another human being.“Although our lives have been different in basically every respect, I do feel in a strange way that we’ve taken different routes to reach similar points, and there’s a lot we recognise in one another.”I don’t tend to jump at the hottest trends in contemporary literature. I also don’t stay away from them just for the sake of doing so. Something has to really catch my eye to make me want to read it. Then it doesn’t matter what your name is – whether highly renowned or relatively obscure. If I’m curious, the curiosity has to be satisfied. That’s what happened here with Sally Rooney. I was a wee bit interested in her earlier books, but hadn’t gotten around to reading them quite yet. Then I saw the title of this one. Yep, just the title. That’s all it took. Maybe it sounds a bit trite, but Beautiful World, Where Are You sounded a whole lot like a question I’ve been asking myself lately! And then I heard that part of the structure of this novel involves a series of long emails between two friends. I knew then I had to read it! I love reading and writing long emails. There aren’t many friends that will oblige such silly inclinations like this, but there exist a couple of dear enablers that will not only tolerate such ramblings, but return the pleasure as well. “You should know that our correspondence is my way of holding on to life, taking notes on it, and thereby preserving something of my—otherwise almost worthless, or even entirely worthless—existence on this rapidly degenerating plane…”Sally Rooney, I want to kiss you!! I fell in love with this book! She knows people. She knows that some of us are unlikable; we have faults, indulge in selfishness, and harbor inner turmoil. And yet, there is something in each one of us that wants to be seen and heard, and loved. We all deserve it despite our shortcomings, don’t we? Alice, Eileen, Simon and Felix. I don’t know. They felt so real to me. I brought them along with me on a little weekend getaway. I read about their agonies, their desires, their little obsessive thoughts. I fell asleep with them on my mind. I’m not a mirror image of any one of them. But I could easily say that there was a piece of each of them that I recognized in myself. Whether it was good or bad, well, what can I say? The age gap didn’t matter to me one bit. I was that age once. A bit of my former self is still a part of me now. It made me who I am, so why dismiss it?“Maybe certain kinds of pain, at certain formative stages in life, just impress themselves into a person’s sense of self permanently.”The dialogue was hugely engaging. The sex was awkward but in a wholly realistic way. I sensed two people trying to figure out how to be with one another, not some perfectly staged scene between lovers. Insecurities and all that messy stuff get in the way a lot of the time. Yet, how can I describe how I felt while reading this? I’ll spare you the intimate details of how I felt… Best to let Rooney’s words explain a bit further.“Our ways of thinking and speaking about sexuality seem so limited, compared to the exhausting and debilitating power of sexuality itself as we experience it in our real lives.”There’s a whole lot to this novel. I’m only scratching the surface here. The emails between two best friends, Alice and Eileen, allow Rooney to offer some interesting thoughts on politics, the process of reading and writing, religion, sexuality, friendships, and loads more. Characters are disillusioned with life, but threads of hope for the future are offered in little doses. That is, after all, how we manage to forge ahead day after day. I don’t know, as much as we seem to be a people engaged mostly with our screens and phones, I think that the younger generation will bring about some much needed change. They are tolerant of differences, passionate about their beliefs, and forward-thinking. I believe we should listen to their fresh new voices, and I count Sally Rooney’s among them. I’ve already bought another of her books and plan to listen to everything she has to say to us now. This is going to be one of my favorites of the year!“… were they somehow invulnerable to, untouched by, vulgarity and ugliness, glancing for a moment into something deeper, something concealed beneath the surface of life, not unreality but a hidden reality: the presence at all times, in all places, of a beautiful world?”I read Normal People a while ago and it was honestly a 1 star from me, but then it became so popular I never actually understood what the fuss was all about concerning this book. Looking at all the positive reviews about a mediocre book made me confused: was it just me ? was I not in the mood for it back then to grasp on a deeper level ? So I decided to give Conversations with Friends by the same author a go. Again it did not resonate with me. So I thought maybe I if I were still at uni, I would have related more with the characters of Sally Rooney, and I left it at that. So Rooney comes up with another book. And again I picked it up, just because ... well, FOMO.To be honest, I was excited about this one, because I thought at least the characters are my age, so what's my excuse this time ? turns out, just like her other books, Sally Rooney 's writing is by no means extraordinary: Beautiful world, where are you is about this writer Alice (29) and her friend Eileen of the same age, who becomes successful after publishing two novels, and then went into a writing slump, (the book isn't about her going out of her slump by any means). Eileen on the other hand chose a simpler life as a small editor in a company whose sole income comes from grants. Eileen is in a supposedly complicated on and off relationship with her childhood friend Simon, (the relationship whilst intended as complicated is boring and I wouldn't even place it in a miscommunication trope as Simon flat out asks Eileen what she wants from him every 2 pages). Alice on the other hand meets Felix a bisexual warehouse worker whom she invites to a trip to Rome and they engage in this very ordinary relationship that involves little character development but too much sex. I did not enjoy this story, primarily because:1- The characters are shallow, and 2- the plot, well, we know that already by now, there's no plot. 3- And just like her other books, people will read between the lines, they will give deeper analysis than what the book ever sought out to provide. 4- some passages in this book felt like they were copy-pasted straight from a wikipedia page, just to make the book look a bit more interesting somehow, even though the information given doesn't serve any purpose plot or character related.Finally, it is safe to assume that this author's popularity will benefit greatly from the fans doing the hard work of giving characters deeper dimensions because simply, the author is unable to do so.DNF 40%Niby mogłabym do kończyć, ale po co. Słuchałam w audio i nie byłam gotowa na ten pseudoerotyk. Homegirl really wrote a smutty romance and fooled us all into thinking she had produced the next literary masterpiece. Truly iconic.All jokes aside, I really do admire Rooney for succeeding in what hundreds of writers before her couldn't do: give female-focused erotic romance the literary status its male equivalent has long been granted. Gone are the days when you had to hide your Harlequin novel inside The Brothers Karamazov for fear of being judged by other passengers on public transport: now you can read the latest Sally Rooney in broad daylight and even pass for a sophisticated intellectual.One small step for an author, one giant leap for publ"
}